curvedDuctFlowPiso/opt/openfoam240/tutorials/lagrangian/reactingParcelFilmFoam/cylinder/constant/foam.inp
species
(
    O2
    H2O
    N2
)
;

reactions
{}
